app/views/courses/index.html.erb

        <% if current_user != nil %>
          <% if current_user.courses.include?(@course) %>
---
SELECT "courses".* FROM "courses"