app/controllers/courses_controller.rb

INSERT INTO "courses" ("naam", "cursusduur", "begindatum", "einddatum", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["naam", "Test"], ["cursusduur", "23 uur"], ["begindatum", "2015-12-08"], ["einddatum", "2015-12-12"], ["created_at", "2015-12-08 16:27:27.999036"], ["updated_at", "2015-12-08 16:27:27.999036"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "cursusduur" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["cursusduur", "235234535"], ["updated_at", "2015-12-08 16:33:35.789734"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)