app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    authorize! :manage, User
    @users = User.all

INSERT INTO "users" ("email", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.add_role(:cursist)
    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    if current_user.has_role? :cursist or current_user.has_role? :teacher
      if  @user = current_user
        authorize! :update, User
      end
    elsif current_user.has_role? :admin
      authorize! :manage, User

      # Gebruikersrollen toggle, toggle_role begint vanaf regel 110
      @user = User.find(params[:id])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    if current_user.has_role? :cursist or current_user.has_role? :teacher
      if  @user = current_user
        authorize! :destroy, User
      end
    elsif current_user.has_role? :admin
      authorize! :manage, User
    end
    @user.destroy